# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
#Your code here
c.execute('''SELECT * FROM offices
                      JOIN employees
                      USING(officeCode);
                      ''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.loc[df['city']=='Boston',['lastName','firstName']]

    lastName firstName
6   Firrelli     Julie
7  Patterson     Steve

## Do any offices have no employees?

0 offices have no employees.

In [4]:
#Your code here
df.loc[df['employeeNumber']=='']

Empty DataFrame
Columns: [officeCode, city, phone, addressLine1, addressLine2, state, country, postalCode, territory, employeeNumber, lastName, firstName, extension, email, reportsTo, jobTitle]
Index: []

## Write 3 Questions of your own and answer them

Which employees report to no one?

Who works at office code 3?

Who works outside of the USA?

In [5]:
# Your code here
df.loc[df['reportsTo']=='',['lastName','firstName']]

  lastName firstName
0   Murphy     Diane

In [6]:
# Your code here
df.loc[df['officeCode']=='3']

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory,employeeNumber,lastName,firstName,extension,email,reportsTo,jobTitle
8,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,1143,Sales Rep
9,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,1143,Sales Rep

In [7]:
# Your code here
df.loc[df['country']!='USA',['lastName','firstName','country']]

     lastName firstName    country
10     Bondur    Gerard     France
11     Bondur      Loui     France
12  Hernandez    Gerard     France
13   Castillo    Pamela     France
14     Gerard    Martin     France
15      Nishi      Mami      Japan
16       Kato   Yoshimi      Japan
17  Patterson   William  Australia
18     Fixter      Andy  Australia
19      Marsh     Peter  Australia
20       King       Tom  Australia
21       Bott     Larry         UK
22      Jones     Barry         UK

## Level Up: Display the names of each product each employee has sold.

In [10]:
# Your code here
c.execute('''SELECT * FROM employees e
                      JOIN customers c
                      ON c.salesRepEmployeeNumber = e.employeeNumber
                      JOIN orders
                      USING(customerNumber)
                      JOIN orderdetails
                      USING(orderNumber)
                      JOIN products
                      USING(productCode);
                      ''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]

In [50]:
df[['productName','lastName','firstName']]
#df[['productName','lastName','firstName']].loc[df['productName'].unique()]

                                      productName  lastName firstName
0                                  1958 Setra Bus  Jennings    Leslie
1                          1940 Ford Pickup Truck  Jennings    Leslie
2                         1939 Cadillac Limousine  Jennings    Leslie
3     1996 Peterbilt 379 Stake Bed with Outrigger  Jennings    Leslie
4                               1968 Ford Mustang  Jennings    Leslie
5                              1968 Dodge Charger  Jennings    Leslie
6                         1970 Plymouth Hemi Cuda  Jennings    Leslie
7                              1969 Dodge Charger  Jennings    Leslie
8                     1948 Porsche 356-A Roadster  Jennings    Leslie
9                            1969 Dodge Super Bee  Jennings    Leslie
10                          1976 Ford Gran Torino  Jennings    Leslie
11                               1957 Vespa GS150  Jennings    Leslie
12                      1957 Corvette Convertible  Jennings    Leslie
13                        1982 Ducati 900 Monster  Jennings    Leslie
14                        1982 Lamborghini Diablo  Jennings    Leslie
15                      1971 Alpine Renault 1600s  Jennings    Leslie
16                        1956 Porsche 356A Coupe  Jennings    Leslie
17                          1961 Chevrolet Impala  Jennings    Leslie
18                              1982 Ducati 996 R  Jennings    Leslie
19                      1974 Ducati 350 Mk3 Desmo  Jennings    Leslie
20                             2002 Yamaha YZR M1  Jennings    Leslie
21                              2001 Ferrari Enzo  Jennings    Leslie
22                             1969 Corvair Monza  Jennings    Leslie
23                               1969 Ford Falcon  Jennings    Leslie
24                              1903 Ford Model A  Jennings    Leslie
25                       Collectable Wooden Train  Jennings    Leslie
26                          1970 Triumph Spitfire  Jennings    Leslie
27                            1904 Buick Runabout  Jennings    Leslie
28                          18th century schooner  Jennings    Leslie
29               1912 Ford Model T Delivery Wagon  Jennings    Leslie
...                                           ...       ...       ...
2966                     1917 Grand Touring Sedan    Gerard    Martin
2967                           1911 Ford Town Car    Gerard    Martin
2968                    1932 Model A Ford J-Coupe    Gerard    Martin
2969                       1928 Mercedes-Benz SSK    Gerard    Martin
2970                  1939 Chevrolet Deluxe Coupe    Gerard    Martin
2971    1938 Cadillac V-16 Presidential Limousine    Gerard    Martin
2972             1936 Mercedes Benz 500k Roadster    Gerard    Martin
2973                            2001 Ferrari Enzo    Gerard    Martin
2974                           1969 Corvair Monza    Gerard    Martin
2975                      1939 Cadillac Limousine    Gerard    Martin
2976                     1962 Volkswagen Microbus    Gerard    Martin
2977                        1936 Chrysler Airflow    Gerard    Martin
2978                  1980’s GM Manhattan Express    Gerard    Martin
2979  1996 Peterbilt 379 Stake Bed with Outrigger    Gerard    Martin
2980                              1982 Camaro Z28    Gerard    Martin
2981                            1957 Chevy Pickup    Gerard    Martin
2982               1998 Chrysler Plymouth Prowler    Gerard    Martin
2983                       1964 Mercedes Tour Bus    Gerard    Martin
2984                        1926 Ford Fire Engine    Gerard    Martin
2985                  1992 Ferrari 360 Spider red    Gerard    Martin
2986                           1970 Dodge Coronet    Gerard    Martin
2987                     1962 Volkswagen Microbus    Gerard    Martin
2988          1958 Chevy Corvette Limited Edition    Gerard    Martin
2989            1992 Porsche Cayenne Turbo Silver    Gerard    Martin
2990                  1980’s GM Manhattan Express    Gerard    Martin
2991                  1954 Greyhound Scenicruiser    Gerard    Martin
2992       1950's Chicago Surface Lines Streetcar    Gerard    Martin
2993             Diamond T620 Semi-Skirted Tanker    Gerard    Martin
2994                           1911 Ford Town Car    Gerard    Martin
2995             1936 Mercedes Benz 500k Roadster    Gerard    Martin

[2996 rows x 3 columns]

In [53]:
df.loc(df['productName']=='1958 Setra Bus','lastName']

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!